<div class="container mt-4 mb-4">
    <div class="card">
        <div class="card-header text-center">
            <h3><i class="fas fa-book text-primary"></i><b> ประวัติวัดนครสวรรค์</b></h3>
        </div>
        <div class="card-body">
            <div class="container">

                <h5>วัดนครสวรรค์ เดิมมีนามว่า “วัดหัวเมือง” เพราะตั้งอยู่ตอนต้นของตัวเมืองก่อนจะเข้าถึงตัวเมืองจะต้องผ่านวัดนี้ก่อน สร้างขึ้นในราว พ.ศ.1972 
            โดยประมาณ เดิมหน้าวัดอยู่ทางริมแม่น้ำเจ้าพระยามีต้นโพธิ์และพระปรางค์มองเห็นเด่นชัดสำหรับผู้สัญจรทางน้ำ 
            ต่อมาสายน้ำได้เปลี่ยนทิศทางห่างออกไปจากวัดประมาณ 100 เมตร เป็นวัดที่ได้รับพระราชทานวิสุงคามสีมา มาแต่เดิม ประมาณ พ.ศ.1972
            วัดนครสวรรค์ เป็นพระอารามหลวงชั้นตรี ชนิดสามัญ ตั้งอยู่เลขที่ 702 ถนนโกสีย์ ตำบลปากน้ำโพ อำเภอเมืองนครสวรรค์ จังหวัดนครสวรรค์ สังกัดคณะสงฆ์มหานิกาย 
            มีที่ดินตั้งวัดเนื้อที่ 22 ไร่ 1 งาน 35 ตารางวา อาณาเขตเฉพาะส่วนที่เป็นเขตพุทธาวาส ทิศเหนือยาว 67 วา ติดต่อกับถนนเทพสิทธิชัย ทิศใต้ยาว 67 วา 
            ติดต่อกับถนนลูกเสือ ทิศตะวันออกยาว 76 วา ติดต่อกับถนนโกสีย์ ทิศตะวันตกยาว 80 วา 
            ติดต่อกับถนนสวรรค์วิถี ซึ่งเป็นถนนผ่ากลางที่ดินตั้งวัด มีโฉนดที่ดินเลขที่ 9943, 9639 และมีที่ธรณีสงฆ์จำนวน 5 แปลง เนื้อที่ 118 ไร่ 99 ตารางวา 
            โฉนดที่ดินเลขที่ 11253, 22673, 1041, 111 และ น.ส. 3 สารบบหน้า 38 เล่ม 1 ที่ธรณีสงฆ์นี้ตั้งอยู่ตำบลปากน้ำโพ 2 แปลง ตำบลบางม่วง 1 แปลง 
            ตำบลศาลาแดง อำเภอโกรกพระ 1 แปลง และตำบลเนินมะกอก อำเภอโกรกพระ จังหวัดนครสวรรค์ 1 แปลง
            พื้นที่ตั้งวัดเป็นที่ราบ มีลักษณะเป็นรูปสี่เหลี่ยมคางหมู มีกำแพงโดยรอบทั้ง 4 ด้าน และมีประตูเข้าออกได้สะดวกทั้ง 4 ด้าน เช่นกัน 
            ที่ดินตั้งวัดนี้ได้ถูกถนนสวรรค์วิถีตัดผ่านแบ่งเนื้อที่ออกเป็น 2 แปลงเป็นเขตสังฆาวาส และเขตพุทธาวาสในส่วนที่อยู่ทางด้านทิศตะวันออกซึ่งมีเนื้อที่ 13 ไร่ 25 ตารางวา 
            อีกแปลงหนึ่งอยู่ทางทิศตะวันตกใช้เป็นเขตฌาปนสถาน มีเนื้อที่ 9 ไร่ 1 งาน 11 ตารางวา ภายในบริเวณวัดมีถนนติดต่อระหว่างอาคารเสนาสนะต่าง ๆ ถึงกันหมด
            อาคารเสนาสนะต่าง ๆ มีพระอุโบสถกว้าง 12 เมตร ยาว 26 เมตร บูรณะ พ.ศ. 2515 ศาลาการเปรียญกว้างยาวด้านละ 34 เมตร เป็นอาคารคอนกรีต 2 ชั้น 
            สร้าง พ.ศ. 2526 กฎิสงฆ์ จำนวน 15 หลัง เป็นอาคารคอนกรีต 9 หลัง อาคารไม้สัก 2 ชั้น 1 หลัง ห้องสมุดจตุรมุขกว้าง 11 เมตร ยาว 12 เมตร 
            อาคารคอนกรีต หอระฆังจตุรมุขสร้างด้วยไม้ทั้งหลัง อาคารเรียนพระปริยัติธรรมกว้าง 24.50 เมตร ยาว 28.50 เมตร เป็นอาคารคอนกรีต 2 ชั้น มีมุขหน้าและหลัง 
            พระวิหารสร้างด้วยอิฐโบราณแผ่นใหญ่ บูรณะ พ.ศ. 2527 อาคารสำนักงานมูลนิธิการกุศล 1 หลัง ศาลาบำเพ็ญกุศล 8 หลัง และฌาปนสถานแบบเตาอบคอนกรีตเสริมเหล็ก
            </h5>

            </div>

        </div>
    </div>
</div>
